---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.OwningMassId
source: html/6a8ef77b-fb82-adfa-74df-b37182ec679c.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.OwningMassId Property

The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.

## Syntax (C#)
```csharp
public ElementId OwningMassId { get; }
```